agussolari/fsae_ecu/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: LPC55S06
package_id: LPC55S06JBD64
mcu_data: ksdk2_0
processor_version: 12.0.0
pin_labels:
- {pin_num: '61', pin_signal: PIO0_29/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT3/SCT0_OUT8/CMP0_OUT/PLU_OUT2/SECURE_GPIO0_29, label: UART_RX, identifier: UART_RX}
- {pin_num: '63', pin_signal: PIO0_30/FC0_TXD_SCL_MISO_WS/CTIMER0_MAT0/SCT0_OUT9/SECURE_GPIO0_30, label: UART_TX, identifier: UART_TX}
- {pin_num: '42', pin_signal: PIO1_3/CAN0_RD/SCT0_OUT4/HS_SPI_MISO/PLU_OUT6, label: CAN_RX, identifier: CAN_RX}
- {pin_num: '41', pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/HS_SPI_SCK/PLU_OUT5, label: CAN_TX, identifier: CAN_TX}
- {pin_num: '12', pin_signal: PIO0_23/MCLK/CTIMER1_MAT2/CTIMER3_MAT3/SCT0_OUT4/FC0_CTS_SDA_SSEL0/SECURE_GPIO0_23/ADC0_0, label: ADC_THROTTLE, identifier: ADC_THROTTLE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '61', peripheral: FLEXCOMM0, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO0_29/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT3/SCT0_OUT8/CMP0_OUT/PLU_OUT2/SECURE_GPIO0_29,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '63', peripheral: FLEXCOMM0, signal: TXD_SCL_MISO_WS, pin_signal: PIO0_30/FC0_TXD_SCL_MISO_WS/CTIMER0_MAT0/SCT0_OUT9/SECURE_GPIO0_30, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '12', peripheral: ADC0, signal: 'CH, 0', pin_signal: PIO0_23/MCLK/CTIMER1_MAT2/CTIMER3_MAT3/SCT0_OUT4/FC0_CTS_SDA_SSEL0/SECURE_GPIO0_23/ADC0_0, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled, asw: enabled}
  - {pin_num: '42', peripheral: CAN0, signal: CAN_RD, pin_signal: PIO1_3/CAN0_RD/SCT0_OUT4/HS_SPI_MISO/PLU_OUT6}
  - {pin_num: '41', peripheral: CAN0, signal: CAN_TD, pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/HS_SPI_SCK/PLU_OUT5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    const uint32_t gpio_config = (
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    IOCON_PinMuxSet(IOCON, 1U, 29U, gpio_config); //START BUTTON
    IOCON_PinMuxSet(IOCON, 0U, 14U, gpio_config);  //DRIVE BUTTON
    IOCON_PinMuxSet(IOCON, 0U, 0U, gpio_config);  //STOP BUTTON
    IOCON_PinMuxSet(IOCON, 1U, 0U, gpio_config);  //CALIBRATION BUTTON


	const uint32_t adc_config = IOCON_PIO_DIGIMODE(0) | IOCON_PIO_ASW(1);

	IOCON_PinMuxSet(IOCON, 0, 23, adc_config); //TPS1
	IOCON_PinMuxSet(IOCON, 0, 16, adc_config); //TPS2
	IOCON_PinMuxSet(IOCON, 0, 31, adc_config); //FRONT BRAKE
	IOCON_PinMuxSet(IOCON, 1, 0 , adc_config); //REAR BRAKE
	IOCON_PinMuxSet(IOCON, 0, 15, adc_config); //DIRECTION

//SWO PIN
    const uint32_t port0_pin10_config = (/* Pin is configured as SWO */
                                         IOCON_PIO_FUNC6 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* Analog switch is open (disabled) */
                                         IOCON_PIO_ASW_DI);
    /* PORT0 PIN10 (coords: 13) is configured as SWO */
    IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);

//INNIT CAN PINS
        const uint32_t port1_pin2_config = (/* Pin is configured as CAN0_TD */
                                            IOCON_PIO_FUNC1 |
                                            /* Selects pull-up function */
                                            IOCON_PIO_MODE_PULLUP |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN2 (coords: 41) is configured as CAN0_TD */
        IOCON_PinMuxSet(IOCON, 1U, 2U, port1_pin2_config);

        const uint32_t port1_pin3_config = (/* Pin is configured as CAN0_RD */
                                            IOCON_PIO_FUNC1 |
                                            /* Selects pull-up function */
                                            IOCON_PIO_MODE_PULLUP |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN3 (coords: 42) is configured as CAN0_RD */
        IOCON_PinMuxSet(IOCON, 1U, 3U, port1_pin3_config);



//INIT UART PINS
    	const uint32_t port0_pin29_config = (/* Pin is configured as FC0_RXD_SDA_MOSI_DATA */
    			IOCON_PIO_FUNC1 |
    			/* No addition pin function */
    			IOCON_PIO_MODE_INACT |
    			/* Standard mode, output slew rate control is enabled */
    			IOCON_PIO_SLEW_STANDARD |
    			/* Input function is not inverted */
    			IOCON_PIO_INV_DI |
    			/* Enables digital function */
    			IOCON_PIO_DIGITAL_EN |
    			/* Open drain is disabled */
    			IOCON_PIO_OPENDRAIN_DI);
    	/* PORT0 PIN29 (coords: 61) is configured as FC0_RXD_SDA_MOSI_DATA */
    	IOCON_PinMuxSet(IOCON, 0U, 29U, port0_pin29_config);

    	const uint32_t port0_pin30_config = (/* Pin is configured as FC0_TXD_SCL_MISO_WS */
    			IOCON_PIO_FUNC1 |
    			/* No addition pin function */
    			IOCON_PIO_MODE_INACT |
    			/* Standard mode, output slew rate control is enabled */
    			IOCON_PIO_SLEW_STANDARD |
    			/* Input function is not inverted */
    			IOCON_PIO_INV_DI |
    			/* Enables digital function */
    			IOCON_PIO_DIGITAL_EN |
    			/* Open drain is disabled */
    			IOCON_PIO_OPENDRAIN_DI);
    	/* PORT0 PIN30 (coords: 63) is configured as FC0_TXD_SCL_MISO_WS */
    	IOCON_PinMuxSet(IOCON, 0U, 30U, port0_pin30_config);


//INIT SPI PINS
////SPI3
//    const uint32_t port0_pin6_config = (/* Pin is configured as FC3_SCK */
//                                        IOCON_PIO_FUNC1 |
//                                        /* Selects pull-up function */
//                                        IOCON_PIO_MODE_PULLUP |
//                                        /* Standard mode, output slew rate control is enabled */
//                                        IOCON_PIO_SLEW_STANDARD |
//                                        /* Input function is not inverted */
//                                        IOCON_PIO_INV_DI |
//                                        /* Enables digital function */
//                                        IOCON_PIO_DIGITAL_EN |
//                                        /* Open drain is disabled */
//                                        IOCON_PIO_OPENDRAIN_DI);
//    /* PORT0 PIN6 (coords: 59) is configured as FC3_SCK */
//    IOCON_PinMuxSet(IOCON, 0U, 6U, port0_pin6_config);
//
//
//
//    const uint32_t port0_pin4_config = (/* Pin is configured as FC3_CTS_SDA_SSEL0 */
//                                        IOCON_PIO_FUNC8 |
//                                        /* Selects pull-up function */
//                                        IOCON_PIO_MODE_PULLUP |
//                                        /* Standard mode, output slew rate control is enabled */
//                                        IOCON_PIO_SLEW_STANDARD |
//                                        /* Input function is not inverted */
//                                        IOCON_PIO_INV_DI |
//                                        /* Enables digital function */
//                                        IOCON_PIO_DIGITAL_EN |
//                                        /* Open drain is disabled */
//                                        IOCON_PIO_OPENDRAIN_DI);
//    /* PORT0 PIN4 (coords: 57) is configured as FC3_CTS_SDA_SSEL0 */
//    IOCON_PinMuxSet(IOCON, 0U, 4U, port0_pin4_config);
//
//
//
//    const uint32_t port0_pin2_config = (/* Pin is configured as FC3_TXD_SCL_MISO_WS */
//                                        IOCON_PIO_FUNC1 |
//                                        /* Selects pull-up function */
//                                        IOCON_PIO_MODE_PULLUP |
//                                        /* Standard mode, output slew rate control is enabled */
//                                        IOCON_PIO_SLEW_STANDARD |
//                                        /* Input function is not inverted */
//                                        IOCON_PIO_INV_DI |
//                                        /* Enables digital function */
//                                        IOCON_PIO_DIGITAL_EN |
//                                        /* Open drain is disabled */
//                                        IOCON_PIO_OPENDRAIN_DI);
//    /* PORT0 PIN2 (coords: 54) is configured as FC3_TXD_SCL_MISO_WS */
//    IOCON_PinMuxSet(IOCON, 0U, 2U, port0_pin2_config);
//
//    const uint32_t port0_pin3_config = (/* Pin is configured as FC3_RXD_SDA_MOSI_DATA */
//                                        IOCON_PIO_FUNC1 |
//                                        /* Selects pull-up function */
//                                        IOCON_PIO_MODE_PULLUP |
//                                        /* Standard mode, output slew rate control is enabled */
//                                        IOCON_PIO_SLEW_STANDARD |
//                                        /* Input function is not inverted */
//                                        IOCON_PIO_INV_DI |
//                                        /* Enables digital function */
//                                        IOCON_PIO_DIGITAL_EN |
//                                        /* Open drain is disabled */
//                                        IOCON_PIO_OPENDRAIN_DI);
//    /* PORT0 PIN3 (coords: 55) is configured as FC3_RXD_SDA_MOSI_DATA */
//    IOCON_PinMuxSet(IOCON, 0U, 3U, port0_pin3_config);
//
////SPI1
//    const uint32_t port0_pin7_config = (/* Pin is configured as FC1_SCK */
//									IOCON_PIO_FUNC4 |
//									/* Selects pull-up function */
//									IOCON_PIO_MODE_PULLUP |
//									/* Standard mode, output slew rate control is enabled */
//									IOCON_PIO_SLEW_STANDARD |
//									/* Input function is not inverted */
//									IOCON_PIO_INV_DI |
//									/* Enables digital function */
//									IOCON_PIO_DIGITAL_EN |
//									/* Open drain is disabled */
//									IOCON_PIO_OPENDRAIN_DI);
//        /* PORT0 PIN7 (coords: 60) is configured as FC1_SCK */
//        IOCON_PinMuxSet(IOCON, 0U, 7U, port0_pin7_config);
//


//        const uint32_t port1_pin11_config = (/* Pin is configured as FC1_TXD_SCL_MISO_WS */
//									IOCON_PIO_FUNC2 |
//									/* Selects pull-up function */
//									IOCON_PIO_MODE_PULLUP |
//									/* Standard mode, output slew rate control is enabled */
//									IOCON_PIO_SLEW_STANDARD |
//									/* Input function is not inverted */
//									IOCON_PIO_INV_DI |
//									/* Enables digital function */
//									IOCON_PIO_DIGITAL_EN |
//									/* Open drain is disabled */
//									IOCON_PIO_OPENDRAIN_DI);
//        IOCON_PinMuxSet(IOCON, 1U, 11U, port1_pin11_config);
//
//        const uint32_t port1_pin10_config = (/* Pin is configured as FC1_RXD_SDA_MOSI_DATA */
//									IOCON_PIO_FUNC2 |
//									/* Selects pull-up function */
//									IOCON_PIO_MODE_PULLUP |
//									/* Standard mode, output slew rate control is enabled */
//									IOCON_PIO_SLEW_STANDARD |
//									/* Input function is not inverted */
//									IOCON_PIO_INV_DI |
//									/* Enables digital function */
//									IOCON_PIO_DIGITAL_EN |
//									/* Open drain is disabled */
//									IOCON_PIO_OPENDRAIN_DI);
//        IOCON_PinMuxSet(IOCON, 1U, 10U, port1_pin10_config);



}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
